Prueba de Libreria Pandas

In [36]:
import numpy as np
import pandas as pd

In [37]:
df = pd.DataFrame({'Nombre':['Juan','Charlie','Pedro','Dahiana','Maria']})
df

    Nombre
0     Juan
1  Charlie
2    Pedro
3  Dahiana
4    Maria

In [38]:
indices = ['a','b','c','d','e']
df2 = pd.DataFrame({'Nombre':['Juan','Charlie','Pedro','Dahiana','Maria']}, index=indices)
df2

    Nombre
a     Juan
b  Charlie
c    Pedro
d  Dahiana
e    Maria

In [39]:
df3 = pd.DataFrame({'Nombre':['Juan','Charlie','Pedro','Dahiana','Maria'],'Peso':[80,95,90,65,69]}, 
                   index=indices)
df3

    Nombre  Peso
a     Juan    80
b  Charlie    95
c    Pedro    90
d  Dahiana    65
e    Maria    69

In [40]:
df3['Peso']

a    80
b    95
c    90
d    65
e    69
Name: Peso, dtype: int64

In [41]:
df3['Altura'] = [1.65, 1.90, 1.8, 1.6, 1.65]

In [42]:
df3

    Nombre  Peso  Altura
a     Juan    80    1.65
b  Charlie    95    1.90
c    Pedro    90    1.80
d  Dahiana    65    1.60
e    Maria    69    1.65

Indice de Masa Corporal = (peso/altura)^2

In [43]:
df3['IMC'] = df3['Peso'] / df3['Altura']**2
df3

    Nombre  Peso  Altura        IMC
a     Juan    80    1.65  29.384757
b  Charlie    95    1.90  26.315789
c    Pedro    90    1.80  27.777778
d  Dahiana    65    1.60  25.390625
e    Maria    69    1.65  25.344353

In [44]:
promedio_pesos = df3['Pesos'].mean()
promedio_pesos

KeyError: 'Pesos'

In [ ]:
df3['IMC'].sum()

134.21330152602582

In [ ]:
#Las primeras filas
# df3.head()
df3.tail()

   Nombres  Pesos  Alturas        IMC
a     Juan     80     1.65  29.384757
b  Charlie     95     1.90  26.315789
c    Pedro     90     1.80  27.777778
d  Dahiana     65     1.60  25.390625
e    Maria     69     1.65  25.344353

In [45]:
df3.iloc[3]

Nombre      Dahiana
Peso             65
Altura          1.6
IMC       25.390625
Name: d, dtype: object

In [46]:
df3.dtypes

Nombre     object
Peso        int64
Altura    float64
IMC       float64
dtype: object

In [57]:
df3.to_csv('datos.csv', sep=';')

In [58]:
df3.to_csv('datos.txt')

In [59]:
df3.to_json('datos.json')

In [71]:
datos1 = pd.read_csv('datos.csv', sep=';', index_col=0)
datos1

    Nombre  Peso  Altura        IMC
a     Juan    80    1.65  29.384757
b  Charlie    95    1.90  26.315789
c    Pedro    90    1.80  27.777778
d  Dahiana    65    1.60  25.390625
e    Maria    69    1.65  25.344353

In [76]:
datos2 = datos1.drop(3)
datos2

  Unnamed: 0   Nombre  Peso  Altura        IMC
0          a     Juan    80    1.65  29.384757
1          b  Charlie    95    1.90  26.315789
2          c    Pedro    90    1.80  27.777778
4          e    Maria    69    1.65  25.344353

In [83]:
datos1.iloc[:4]

  Unnamed: 0   Nombre  Peso  Altura        IMC
0          a     Juan    80    1.65  29.384757
1          b  Charlie    95    1.90  26.315789
2          c    Pedro    90    1.80  27.777778
3          d  Dahiana    65    1.60  25.390625

In [84]:
df3.to_numpy()

array([['Juan', 80, 1.65, 29.384756657483933],
       ['Charlie', 95, 1.9, 26.315789473684212],
       ['Pedro', 90, 1.8, 27.777777777777775],
       ['Dahiana', 65, 1.6, 25.390624999999996],
       ['Maria', 69, 1.65, 25.344352617079892]], dtype=object)

In [86]:
#para describir los datos guardados
df3.describe()

            Peso    Altura        IMC
count   5.000000  5.000000   5.000000
mean   79.800000  1.720000  26.842660
std    12.949903  0.125499   1.729713
min    65.000000  1.600000  25.344353
25%    69.000000  1.650000  25.390625
50%    80.000000  1.650000  26.315789
75%    90.000000  1.800000  27.777778
max    95.000000  1.900000  29.384757